docs/MERMAID_MEMOIRE_AFYA.md
```mermaid
classDiagram
  direction TB
  class Receptionniste { <<actor>> }
  class PatientsPage {
    <<boundary>>
    -searchQuery string
    -createForm PatientCreateRequest
    +search() void
    +submitCreate() void
  }
  class PatientBffController {
    <<boundary>>
    +search(query,page,size) Page
    +getById(id) PatientResponse
    +create(request) PatientResponse
    +update(id,request) PatientResponse
  }
  class PatientController {
    <<boundary>>
    -patientRegistryService PatientRegistryService
    +create(request) PatientResponse
    +getById(id) PatientResponse
    +search(query,page,size,sortBy,sortDir) Page
    +update(id,request) PatientResponse
  }
  class PatientRegistryService {
    <<control>>
    +create(request) PatientResponse
    +getById(id) PatientResponse
    +search(...) Page
    -generateDossierNumber() String
  }
  class Patient {
    <<entity>>
    -id Long
    -dossierNumber String
    -firstName String
    -lastName String
    -birthDate LocalDate
    -sex String
  }
  class PatientDossierSequence {
    <<entity>>
    -year int
    -lastValue long
  }
  Receptionniste --> PatientsPage --> PatientBffController --> PatientController
  PatientController --> PatientRegistryService
  PatientRegistryService --> Patient
  PatientRegistryService --> PatientDossierSequence
```
